Revit 2024 API
BuiltInFailures.WallFailures.WallSettingsChanged Property
 Default wall settings will be changed (Base Constraint: [Base Level], Base Offset: [Base Offset], Top Constraint: [Top Level], Top Offset: [Top Offset])
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId WallSettingsChanged { get; }
Visual Basic
Public Shared ReadOnly Property WallSettingsChanged As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ WallSettingsChanged {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace